/* Initial login prompt for username and password */
"Login with username and password" = "Ligar com utilizador e palavra-passe";

/* Lookup of password in Keychain */
"No login credentials could be found in the Keychain" = "Não foi possível encontrar credenciais de acesso válidas no Porta-Chaves";
"The use of the Keychain is disabled in the Preferences" = "O uso do Porta-Chave está desactivado nas Preferências";

/* Password proctected private key for SSH public key authentication */
"Invalid passphrase" = "Frase-passe inválida";
"Private key password protected" = "Chave privada protegida por palavra-passe";
"Enter the passphrase for the private key file" = "Insira a frase-passe para aceder ao ficheiro de chave privada";

"Login canceled" = "Acesso cancelado";
"Login failed" = "Falha no acesso";
"Login successful" = "Acesso estabelecido";

/* Private key selection for SSH public key authentication */
"Select the private key in PEM or PuTTY format" = "Seleccionar a chave privada no formato PEM/PuTTY";

/* Challenge-Respone authentication */
"Partial authentication success" = "Sucesso parcial na autenticação";
"Provide additional login credentials" = "Forneça credenciais de autenticação adicionais";

/* Login prompt placeholders */
"Username" = "Nome de utilizador";
"Password" = "Palavra-passe";
"One-time passcode" = "Código de acesso descartável";

/* Warning when credentials are sent using unsecured protocol. Unsecure FTP connection */
"Unsecured {0} connection" = "Ligação {0} não segura";

/* Credentials sent over plaintext connection */
"{0} will be sent in plaintext." = "{0} será enviado em texto simples.";
"Don't show again" = "Não mostrar novamente";
"Continue" = "Continuar";
"Disconnect" = "Desligar";

/* Protocol switch proposal */
"The server supports encrypted connections. Do you want to switch to {0}?" = "O servidor suporta ligações cifradas. Deseja alterar para {0}?";
"Change" = "Alterar";